import re
import textwrap

import news.crawlers.db.schema
import news.crawlers.util.normalize
import news.crawlers.util.request_url
import news.parse.db.schema
import news.parse.epochtimes


def test_parsing_result() -> None:
    r"""Ensure parsing result consistency."""
    company_id = news.crawlers.util.normalize.get_company_id(company='大紀元')
    url = r'https://www.epochtimes.com/b5/19/10/28/n11617434.htm'
    response = news.crawlers.util.request_url.get(url=url)

    raw_news = news.crawlers.db.schema.RawNews(
        company_id=company_id,
        raw_xml=news.crawlers.util.normalize.compress_raw_xml(
            raw_xml=response.text,
        ),
        url_pattern=news.crawlers.util.normalize.compress_url(
            company_id=company_id,
            url=url,
        )
    )

    parsed_news = news.parse.epochtimes.parser(raw_news=raw_news)

    assert parsed_news.article == re.sub(
        r'\n',
        '',
        textwrap.dedent(
            '''\
            1949年,當一些知識分子紛紛從香港北上去迎接「新中國的誕生」時,錢穆遷往香港。 在他
            看來,中共得天下,就意味著中國幾千年文化傳統的中斷,他在英國屬地香港,創建了香港中文
            大學的前身——新亞書院,以發揚中國文化為最高教育宗旨。 錢穆預言:「此下世界文化之歸趣
            ,必將以中國傳統文化為宗主。」 錢穆,原名恩鑅,字賓四,清光緒廿一年(1895年7月30日)
            生於江蘇無錫的七房橋。他7歲入私塾讀書,1911年因辛亥革命,中學學校停辦,他輟學後自學
            。18歲後,錢穆當了十年小學教師, 1922年以後,他又當了八年中學教師。 一直自學苦修的
            錢穆,致力於史學研究,1930年,因《劉向歆父子年譜》和《先秦諸子系年》兩篇著作,使學界
            人士對其推崇備至。後由顧頡剛推薦,錢穆被聘為燕京大學國文講師,講授中國上古史和秦漢
            史。 居北平八年,錢穆先後授課於北京大學、清華大學、燕京大學、北平師範大學等名校
            。 在燕大,錢穆見陳寅恪穿長袍,遂改穿長袍,一直堅持到老。當時北大名師雲集,戴金屬細邊
            眼鏡的錢穆,被學生評為北大最叫座的教授之一,學生中有「北胡南錢」之說,胡即指胡適,他
            倆都因以演講的方式授課而聞名。 一次,燕大校長司徒雷登宴請教師,錢穆直言,入燕大校門
            即見M樓、S樓,既然在中國,就該起中國名字。校務會採納了錢穆的建議,後將M樓改為穆樓,
            S樓改為適樓,樓貝公改名辦公樓,其它建築也都賦以中國名稱。校有一湖,因一時無名,就
            根據錢穆的提議取名「未名湖」。 抗日戰爭爆發後,錢穆隨北大南撤到雲南蒙自,期間他與
            詩人、考古學家陳夢家往來密切。陳夢家勸錢穆寫一本中國通史的教科書,後來在陳夢家的
            啟發下,錢穆一反此前中國通史的西方化敘事傾向,寫出《國史大綱》,它飽含強烈的道德意識
            與愛國熱情,展現出「對其本國已往歷史之溫情與敬意」,很快風行全國,成為各大學通用的
            歷史教科書。 而民族危亡之時,西學東漸,很多青年受中共革命文化的影響,當時閱讀的多是
            「左傾進步書籍」,以民族虛無主義為時尚,蔑視和貶低中國傳統文化,稱之為「腐朽沒落」
            。 錢穆二兒子錢行說,「1949年以前,好像真沒讀過父親的什麼書。那時我讀高中時,父親
            有次回來,見到三弟(錢遜)那裡有從蘇聯大使館要來的《列寧選集》,曾經把我們召集在一起
            教育一番。但是當時也不怎樣接受......其實那時候的青年學生,和後來的紅衛兵運動也
            差不多,很狂熱的。」 錢穆勸兒子看《曾國藩家書》,不要看那些「馬列的書」,不要上當、
            相信那些東西。但後來兒子們與馬克思列寧主義接觸,都參加了學生運動,自認為「進步、
            革命」,逐漸遠離了父親。 錢穆在學生時代,也曾參加過學潮,但在北平、西南執教期間,錢穆
            不支持學運,因為中共宣傳馬克思主義,鼓動階級鬥爭與唯物史觀,與他的傳統理念相悖。錢穆
            後來離開了西南聯大,也與當時校園激進的左傾思想有關,「聞一多公開在報紙罵余為冥頑
            不靈。......凡聯大左傾諸教授,幾無不視余為公敵。」 「以中華文化民族意識為論旨」的
            《國史大綱》,受到蔣介石的賞識。1942年,蔣介石約見錢穆,錢穆拒絕了,次年,蔣介石再度
            約見錢穆。提倡宋明理學的蔣介石,與錢穆思想非常相合。後來,錢穆再次受蔣介石的邀請,與
            馮友蘭一起去重慶,為國民黨中央訓練團講演。期間,為錢穆安排的每餐飯蔣介石都要親自去看
            ,親口品嚐是否合口。蔣介石還請錢穆負責《宋元明清學案簡編》裡清代部分的編寫。 錢穆
            多次讚揚孫中山先生所創立的「五權憲法」、「五院制度」,尤其考試制度、監察制度,認為
            充分體現了中國傳統精神,錢穆的價值觀與中共倡導的馬列格格不入。 1949年4月,中共軍隊
            越過天塹長江,挺進江南,很多知識分子面臨去與留的抉擇。錢基博先生的孿生兄長錢基成,對
            中共懷有深望,屢勸錢穆留下。錢穆問他,「您研究古文辭,您看看軍隊渡江的那篇文告,有無
            大度包容之氣象?」錢基成不語。 從文告中,錢穆當時就預感到,赤色中國難有他容身之地。
            而那篇文告正是出自毛澤東之手。 1949年8月,毛澤東發表評論《丟掉幻想,準備鬥爭》,
            點名批評胡適、傅斯年和錢穆三人,說他們是「被帝國主義及其走狗的中國反動政府」所能
            控制的「極少數人」。 錢穆認為自己「單槍匹馬,一介書生」,「足跡不到京、滬、平、津,
            不在公立學校教書」,「怎麼會找到我頭上」。此文發表之前的四個月,胡適已經去了美國;
            八個月前,傅斯年去了台灣。 當時,錢穆正應香港華僑大學之邀,赴廣州任教。10月,錢穆囑託
            蘇州城防司令隨時照顧家小,然後自己隨華僑大學遷至香港,妻子和五個孩子都留在了大陸
            。 錢穆在香港見到許多彷徨的流亡青年走投無路,於是有了創辦大學的想法,「我覺得自己是
            從事教育工作的人,怎忍眼看他們失學。同時,也覺得自己只有這一條適當的路可以走。雖然
            沒有一點把握,但始終認定這是一件應當做的事。」 自認流亡知識分子的錢穆,一邊在《民主
            評論》上發表文章,一邊與謝幼偉、唐君毅、崔書琴等學者,在九龍偉晴街借用華南中學的
            三間課室,籌辦「亞洲文商學院」,夜間上課,由錢穆任院長。 1950年秋,上海商人王岳峰在
            九龍深水埔桂林街61—65號購得新樓三楹,供作新校舍。校舍簡陋,沒有圖書館。亞洲文商
            更名為「新亞書院」,改為日校,錢穆出任院長。 學校經費困難,辦公室晚上就是臥室。錢穆
            自奉節儉,先是棲身在校舍打地鋪,後搬到貧民區,再搬到偏遠鄉村租房。他每天搭巴士、火車
            上課,立定講壇,舌耕不輟。 學生幾乎全部是來自內地的流亡青年,很多露宿在學校天台、
            樓梯上。師生不到百人,學費收入僅有20%,每月虧空多達三千多港幣。後來蔣介石一直幫助了
            四年,數年後,學校獲得美國耶魯、哈佛的援助,蔣介石才開始停止撥款。 錢穆公開在校刊上
            撰文,指出:「本書院創始,在一九四九年之秋,當時因有感於共產黨在中國大陸刻意摧殘本國
            文化,故本書院特以發揚中國文化為教育之最高宗旨......在今日民主主義與極權鬥爭之下,
            中國青年在思想上應有正確的認識,以免誤入歧途,既誤其本身前途,亦遺害於國家民族以及
            世界和平。」 1958年的一天,錢穆的長子錢拙接到一封父親來信。信中說,人民公社搞得
            這麼糟,還要辦公共食堂,家家戶戶把自己的鍋灶都打掉,吃公共食堂,「這不是亂了套嘛!
            」 1963年,新亞書院、崇基學院、聯合書院三校合併為大學,68歲的錢穆親定校名為「香港
            中文大學」。 在英國屬地香港,有了第一所中文教學的大學。 1966年,「文化大革命」開始
            ,大陸大中學校一度陷於停頓。據錢穆夫人胡美琦回憶,錢穆日夜在長廊上走來走去,一言不發
            ,持續一兩個月之久。一天,錢穆突然說,他要編一部《人人自修國文讀本》,這樣將來即使
            教師和課程都沒有了,也可以此為研讀文言文籍的國人開一門徑,挽救傳統文化中斷的危機
            。 錢穆畢生信仰中國傳統文化,重視儒家家庭倫理,尤重父子之情。初到香港時,錢穆曾經與
            余英時一家看電影,內容是關於親子之情的。想起在大陸的兒女,錢穆當時禁不住悄然淚下,而
            錢穆向來是能夠「以理馭情」的。 1950年,錢穆寫信給留在大陸的三個兒子,希望他們到香港
            讀書。當時中共貶斥錢穆「賣國」,受輿論影響,兄弟三人認為父親「逃港」即是不愛國的行為
            。當時18歲的二兒子錢行,甚至將毛的報紙文章寄給錢穆。錢穆想與子女團聚的願望沒有實現
            。 1949年後,因錢穆反共的立場,子女的工作與生活都受到了株連,他們也曾以所謂「愛國」
            大義責備父親。 當錢穆在國外創建大學傳播中國傳統文化時,三子錢遜在國內清華大學的講台
            上,當了二十多年的馬列教師,教授辯證唯物主義與歷史唯物主義。 錢行後來被舉家下放,
            女兒錢易也被下放到江西開荒種地。為避免牽連,錢穆和子女斷絕了書信往來。 在中共的集權
            高壓下,錢穆父子異途,父慈子孝各不可得。直到三十一年後的1980年,子女們才與父親重聚,
            錢穆其時已85歲。而錢行藉助赴港探親的事由,才找機會辦了返城手續。 錢遜讀父親的著作
            時,已年近五旬,曾經叛逆的錢遜,為自己曾經批判國學而感慚愧;錢行70歲時,以「畢明邇」
            為名,發表文章替父親辯駁:「中國的幾千年說成都是封建、都是專制,是錢先生所最反對的。
            ......有皇帝,不等於就是專制,反之,沒皇帝了也不等於就沒專制。」 錢穆死後,胡美琦
            公開發表文章談到,與子女相見時,錢穆一直等待子女向自己道歉或者做個說明,文革時孩子
            為什麼用那麼「革命」的態度對待自己的父親,但錢穆沒有等到,心中耿耿卻難以言表。
            '''
        ),
    )
    assert parsed_news.category == '文化網,史海鉤沉,中國歷代名人,歷代文人'
    assert parsed_news.company_id == company_id
    assert parsed_news.timestamp == 1572192000
    assert parsed_news.reporter is None
    assert parsed_news.title == '遠離中共 在港建中文大學的錢穆'
    assert parsed_news.url_pattern == '19-10-28-11617434'
